; ModuleID = 'test_rust.3b402897-cgu.0'
source_filename = "test_rust.3b402897-cgu.0"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx11.0.0"

%Sheep = type { { [0 x i8]*, i64 }, i8, [7 x i8] }
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Opaque" = type {}
%"core::panic::location::Location" = type { { [0 x i8]*, i64 }, i32, i32 }
%"unwind::libunwind::_Unwind_Exception" = type { i64, void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [2 x i64] }
%"unwind::libunwind::_Unwind_Context" = type { [0 x i8] }

@alloc19 = private unnamed_addr constant <{ [0 x i8] }> zeroinitializer, align 8
@alloc23 = private unnamed_addr constant <{ [21 x i8] }> <{ [21 x i8] c" is already naked...\0A" }>, align 1
@alloc22 = private unnamed_addr constant <{ i8*, [8 x i8], i8*, [8 x i8] }> <{ i8* getelementptr inbounds (<{ [0 x i8] }>, <{ [0 x i8] }>* @alloc19, i32 0, i32 0, i32 0), [8 x i8] zeroinitializer, i8* getelementptr inbounds (<{ [21 x i8] }>, <{ [21 x i8] }>* @alloc23, i32 0, i32 0, i32 0), [8 x i8] c"\15\00\00\00\00\00\00\00" }>, align 8
@alloc27 = private unnamed_addr constant <{ [17 x i8] }> <{ [17 x i8] c" gets a haircut!\0A" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "65b94f8f528603bb3efbbd0c03f15ff3")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !{i32 7, !"PIC Level", i32 2}
!25 = !{i32 7, !"PIE Level", i32 2}
!26 = !{i32 2, !"Dwarf Version", i32 2}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !29, producer: "clang LLVM (rustc version 1.60.0 (7737e0b5c 2022-04-04))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !30, globals: !47)
!29 = !DIFile(filename: "../test/test_data/test_rust.rs/@/test_rust.3b402897-cgu.0", directory: "/Users/rkrsn/workspace/raptor-oss/llvm-slicer/build")
!30 = !{!31, !38}
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !32, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagEnumClass, elements: !35)
!32 = !DINamespace(name: "result", scope: !33)
!33 = !DINamespace(name: "core", scope: null)
!34 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!35 = !{!36, !37}
!36 = !DIEnumerator(name: "Ok", value: 0)
!37 = !DIEnumerator(name: "Err", value: 1)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !39, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagEnumClass, elements: !42)
!39 = !DINamespace(name: "v1", scope: !40)
!40 = !DINamespace(name: "rt", scope: !41)
!41 = !DINamespace(name: "fmt", scope: !33)
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "Left", value: 0)
!44 = !DIEnumerator(name: "Right", value: 1)
!45 = !DIEnumerator(name: "Center", value: 2)
!46 = !DIEnumerator(name: "Unknown", value: 3)
!47 = !{!0}
!48 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "core::ops::function::FnOnce::call_once{{vtable.shim}}", scope: !50, file: !49, line: 227, type: !53, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !60, retainedNodes: !57)
!49 = !DIFile(filename: "/rustc/7737e0b5c4103216d6fd8cf941b7ab9bdbaace7c/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "1a40c014f8a7b8b7cd612b461a47e902")
!50 = !DINamespace(name: "FnOnce", scope: !51)
!51 = !DINamespace(name: "function", scope: !52)
!52 = !DINamespace(name: "ops", scope: !33)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !56}
!55 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !{!58, !59}
!58 = !DILocalVariable(arg: 1, scope: !48, file: !49, line: 227, type: !56)
!59 = !DILocalVariable(arg: 2, scope: !48, file: !49, line: 227, type: !7)
!60 = !{!61, !62}
!61 = !DITemplateTypeParameter(name: "Self", type: !14)
!62 = !DITemplateTypeParameter(name: "Args", type: !7)
!63 = !DILocation(line: 227, column: 5, scope: !48)
!64 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "core::ops::function::FnOnce::call_once", scope: !50, file: !49, line: 227, type: !65, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !60, retainedNodes: !67)
!65 = !DISubroutineType(types: !66)
!66 = !{!55, !14}
!67 = !{!68, !69}
!68 = !DILocalVariable(arg: 1, scope: !64, file: !49, line: 227, type: !14)
!69 = !DILocalVariable(arg: 2, scope: !64, file: !49, line: 227, type: !7)
!70 = !DILocation(line: 227, column: 5, scope: !64)
!71 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "core::ops::function::FnOnce::call_once", scope: !50, file: !49, line: 227, type: !72, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !77, retainedNodes: !74)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !20}
!74 = !{!75, !76}
!75 = !DILocalVariable(arg: 1, scope: !71, file: !49, line: 227, type: !20)
!76 = !DILocalVariable(arg: 2, scope: !71, file: !49, line: 227, type: !7)
!77 = !{!78, !62}
!78 = !DITemplateTypeParameter(name: "Self", type: !20)
!79 = !DILocation(line: 227, column: 5, scope: !71)
!80 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::{closure_env#0}<()>>", linkageName: "core::ptr::drop_in_place<std::rt::lang_start<()>::{{closure}}>", scope: !82, file: !81, line: 188, type: !83, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !87, retainedNodes: !85)
!81 = !DIFile(filename: "/rustc/7737e0b5c4103216d6fd8cf941b7ab9bdbaace7c/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "0592540d568e762cd458f12fa2315832")
!82 = !DINamespace(name: "ptr", scope: !33)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !56}
!85 = !{!86}
!86 = !DILocalVariable(arg: 1, scope: !80, file: !81, line: 188, type: !56)
!87 = !{!88}
!88 = !DITemplateTypeParameter(name: "T", type: !14)
!89 = !DILocation(line: 188, column: 1, scope: !80)
!90 = distinct !DISubprogram(name: "is_naked", linkageName: "test_rust::Sheep::is_naked", scope: !92, file: !91, line: 18, type: !103, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !106)
!91 = !DIFile(filename: "../test/test_data/test_rust.rs", directory: "/Users/rkrsn/workspace/raptor-oss/llvm-slicer/build", checksumkind: CSK_MD5, checksum: "4b8a2a3f8e4edf84ae506ab855e598f5")
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sheep", scope: !93, file: !2, size: 192, align: 64, elements: !94, templateParams: !23, identifier: "9014723e6fc2dc0aab022cd3301afb7")
!93 = !DINamespace(name: "test_rust", scope: null)
!94 = !{!95, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "naked", scope: !92, file: !2, baseType: !96, size: 8, align: 8, offset: 128)
!96 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !2, baseType: !98, size: 128, align: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !99, templateParams: !23, identifier: "84eec819988617519061e0b609a72fe3")
!99 = !{!100, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !98, file: !2, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !98, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!96, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&test_rust::Sheep", baseType: !92, size: 64, align: 64, dwarfAddressSpace: 0)
!106 = !{!107}
!107 = !DILocalVariable(name: "self", arg: 1, scope: !90, file: !91, line: 18, type: !105)
!108 = !DILocation(line: 18, column: 17, scope: !90)
!109 = !DILocation(line: 19, column: 9, scope: !90)
!110 = !{i8 0, i8 2}
!111 = !DILocation(line: 20, column: 6, scope: !90)
!112 = distinct !DISubprogram(name: "shear", linkageName: "test_rust::Sheep::shear", scope: !92, file: !91, line: 22, type: !113, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !116)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut test_rust::Sheep", baseType: !92, size: 64, align: 64, dwarfAddressSpace: 0)
!116 = !{!117}
!117 = !DILocalVariable(name: "self", arg: 1, scope: !112, file: !91, line: 22, type: !115)
!118 = !DILocation(line: 22, column: 14, scope: !112)
!119 = !DILocation(line: 23, column: 12, scope: !112)
!120 = !DILocation(line: 27, column: 13, scope: !112)
!121 = !DILocation(line: 25, column: 48, scope: !112)
!122 = !DILocation(line: 25, column: 13, scope: !112)
!123 = !DILocation(line: 31, column: 6, scope: !112)
!124 = !DILocation(line: 29, column: 13, scope: !112)
!125 = !DILocation(line: 23, column: 9, scope: !112)
!126 = distinct !DISubprogram(name: "new", linkageName: "<test_rust::Sheep as test_rust::Animal>::new", scope: !127, file: !91, line: 37, type: !128, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !130)
!127 = !DINamespace(name: "{impl#1}", scope: !93)
!128 = !DISubroutineType(types: !129)
!129 = !{!92, !98}
!130 = !{!131}
!131 = !DILocalVariable(name: "name", arg: 1, scope: !126, file: !91, line: 37, type: !98)
!132 = !DILocation(line: 37, column: 12, scope: !126)
!133 = !DILocation(line: 38, column: 9, scope: !126)
!134 = !DILocation(line: 39, column: 6, scope: !126)
!135 = distinct !DISubprogram(name: "name", linkageName: "<test_rust::Sheep as test_rust::Animal>::name", scope: !127, file: !91, line: 41, type: !136, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !138)
!136 = !DISubroutineType(types: !137)
!137 = !{!98, !105}
!138 = !{!139}
!139 = !DILocalVariable(name: "self", arg: 1, scope: !135, file: !91, line: 41, type: !105)
!140 = !DILocation(line: 41, column: 13, scope: !135)
!141 = !DILocation(line: 42, column: 9, scope: !135)
!142 = !DILocation(line: 43, column: 6, scope: !135)
!143 = distinct !DISubprogram(name: "noise", linkageName: "<test_rust::Sheep as test_rust::Animal>::noise", scope: !127, file: !91, line: 45, type: !136, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !144)
!144 = !{!145}
!145 = !DILocalVariable(name: "self", arg: 1, scope: !143, file: !91, line: 45, type: !105)
!146 = !DILocation(line: 45, column: 14, scope: !143)
!147 = !DILocation(line: 46, column: 12, scope: !143)
!148 = !DILocation(line: 49, column: 13, scope: !143)
!149 = !DILocation(line: 46, column: 9, scope: !143)
!150 = !DILocation(line: 47, column: 13, scope: !143)
!151 = !DILocation(line: 51, column: 6, scope: !143)
!152 = distinct !DISubprogram(name: "talk", linkageName: "<test_rust::Sheep as test_rust::Animal>::talk", scope: !127, file: !91, line: 54, type: !153, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !155)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !105}
!155 = !{!156}
!156 = !DILocalVariable(name: "self", arg: 1, scope: !152, file: !91, line: 54, type: !105)
!157 = !DILocation(line: 54, column: 13, scope: !152)
!158 = !DILocation(line: 56, column: 9, scope: !152)
!159 = !DILocation(line: 56, column: 56, scope: !152)
!160 = !DILocation(line: 57, column: 6, scope: !152)
!161 = distinct !DISubprogram(name: "main", linkageName: "test_rust::main", scope: !93, file: !91, line: 60, type: !21, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagMainSubprogram, unit: !28, templateParams: !23, retainedNodes: !162)
!162 = !{!163}
!163 = !DILocalVariable(name: "dolly", scope: !164, file: !91, line: 62, type: !92, align: 8)
!164 = distinct !DILexicalBlock(scope: !161, file: !91, line: 62, column: 5)
!165 = !DILocation(line: 62, column: 9, scope: !164)
!166 = !DILocation(line: 62, column: 28, scope: !161)
!167 = !DILocation(line: 65, column: 5, scope: !164)
!168 = !DILocation(line: 66, column: 5, scope: !164)
!169 = !DILocation(line: 67, column: 5, scope: !164)
!170 = !DILocation(line: 68, column: 2, scope: !171)
!171 = !DILexicalBlockFile(scope: !161, file: !91, discriminator: 0)
!172 = distinct !DISubprogram(name: "black_box<()>", linkageName: "core::hint::black_box", scope: !174, file: !173, line: 173, type: !175, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !179, retainedNodes: !177)
!173 = !DIFile(filename: "/rustc/7737e0b5c4103216d6fd8cf941b7ab9bdbaace7c/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "bf95e3081dc32061fc222d03331d8091")
!174 = !DINamespace(name: "hint", scope: !33)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !7}
!177 = !{!178}
!178 = !DILocalVariable(name: "dummy", arg: 1, scope: !172, file: !173, line: 173, type: !7)
!179 = !{!180}
!180 = !DITemplateTypeParameter(name: "T", type: !7)
!181 = !DILocation(line: 173, column: 27, scope: !172)
!182 = !DILocation(line: 174, column: 5, scope: !172)
!183 = !{i32 3186872}
!184 = !DILocation(line: 175, column: 2, scope: !172)
!185 = distinct !DISubprogram(name: "to_i32", linkageName: "std::process::ExitCode::to_i32", scope: !187, file: !186, line: 1689, type: !198, scopeLine: 1689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !200)
!186 = !DIFile(filename: "/rustc/7737e0b5c4103216d6fd8cf941b7ab9bdbaace7c/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "ee461ff083257e8efc8b48e1d9bdd68f")
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !188, file: !2, size: 8, align: 8, elements: !189, templateParams: !23, identifier: "bec39850ddc71e69685e2c00f78c81e")
!188 = !DINamespace(name: "process", scope: !17)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !187, file: !2, baseType: !191, size: 8, align: 8)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !192, file: !2, size: 8, align: 8, elements: !196, templateParams: !23, identifier: "c9a7c03b2a958f7d18c2fc3bc942bbc9")
!192 = !DINamespace(name: "process_common", scope: !193)
!193 = !DINamespace(name: "process", scope: !194)
!194 = !DINamespace(name: "unix", scope: !195)
!195 = !DINamespace(name: "sys", scope: !17)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !191, file: !2, baseType: !34, size: 8, align: 8)
!198 = !DISubroutineType(types: !199)
!199 = !{!55, !187}
!200 = !{!201}
!201 = !DILocalVariable(name: "self", arg: 1, scope: !185, file: !186, line: 1689, type: !187)
!202 = !DILocation(line: 1689, column: 19, scope: !185)
!203 = !DILocation(line: 1690, column: 9, scope: !185)
!204 = !DILocation(line: 1691, column: 6, scope: !185)
!205 = distinct !DISubprogram(name: "report", linkageName: "<() as std::process::Termination>::report", scope: !206, file: !186, line: 2048, type: !207, scopeLine: 2048, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !209)
!206 = !DINamespace(name: "{impl#50}", scope: !188)
!207 = !DISubroutineType(types: !208)
!208 = !{!187, !7}
!209 = !{!210}
!210 = !DILocalVariable(name: "self", arg: 1, scope: !205, file: !186, line: 2048, type: !7)
!211 = !DILocation(line: 2048, column: 15, scope: !205)
!212 = !DILocation(line: 2049, column: 9, scope: !205)
!213 = !DILocation(line: 2050, column: 6, scope: !205)
!214 = distinct !DISubprogram(name: "report", linkageName: "<std::process::ExitCode as std::process::Termination>::report", scope: !215, file: !186, line: 2090, type: !216, scopeLine: 2090, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !218)
!215 = !DINamespace(name: "{impl#55}", scope: !188)
!216 = !DISubroutineType(types: !217)
!217 = !{!187, !187}
!218 = !{!219}
!219 = !DILocalVariable(name: "self", arg: 1, scope: !214, file: !186, line: 2090, type: !187)
!220 = !DILocation(line: 2090, column: 15, scope: !214)
!221 = !DILocation(line: 2092, column: 6, scope: !214)
!222 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "std::rt::lang_start", scope: !16, file: !223, line: 139, type: !224, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !179, retainedNodes: !229)
!223 = !DIFile(filename: "/rustc/7737e0b5c4103216d6fd8cf941b7ab9bdbaace7c/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !20, !226, !227}
!226 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !228, size: 64, align: 64, dwarfAddressSpace: 0)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!229 = !{!230, !231, !232, !233}
!230 = !DILocalVariable(name: "main", arg: 1, scope: !222, file: !223, line: 140, type: !20)
!231 = !DILocalVariable(name: "argc", arg: 2, scope: !222, file: !223, line: 141, type: !226)
!232 = !DILocalVariable(name: "argv", arg: 3, scope: !222, file: !223, line: 142, type: !227)
!233 = !DILocalVariable(name: "v", scope: !234, file: !223, line: 144, type: !226, align: 8)
!234 = distinct !DILexicalBlock(scope: !222, file: !223, line: 144, column: 5)
!235 = !DILocation(line: 140, column: 5, scope: !222)
!236 = !DILocation(line: 141, column: 5, scope: !222)
!237 = !DILocation(line: 142, column: 5, scope: !222)
!238 = !DILocation(line: 145, column: 10, scope: !222)
!239 = !DILocation(line: 145, column: 9, scope: !222)
!240 = !DILocation(line: 144, column: 17, scope: !222)
!241 = !DILocation(line: 144, column: 12, scope: !222)
!242 = !DILocation(line: 144, column: 12, scope: !234)
!243 = !DILocation(line: 150, column: 2, scope: !222)
!244 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "std::rt::lang_start::{{closure}}", scope: !15, file: !223, line: 145, type: !245, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !179, retainedNodes: !248)
!245 = !DISubroutineType(types: !246)
!246 = !{!55, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!248 = !{!249}
!249 = !DILocalVariable(name: "main", scope: !244, file: !223, line: 140, type: !20, align: 8)
!250 = !DILocation(line: 140, column: 5, scope: !244)
!251 = !DILocation(line: 145, column: 77, scope: !244)
!252 = !DILocation(line: 145, column: 18, scope: !244)
!253 = !DILocation(line: 145, column: 100, scope: !244)
!254 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "std::sys_common::backtrace::__rust_begin_short_backtrace", scope: !256, file: !255, line: 118, type: !72, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !262, retainedNodes: !258)
!255 = !DIFile(filename: "/rustc/7737e0b5c4103216d6fd8cf941b7ab9bdbaace7c/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "0fa868f8cc86ab35ce9635f981490e7d")
!256 = !DINamespace(name: "backtrace", scope: !257)
!257 = !DINamespace(name: "sys_common", scope: !17)
!258 = !{!259, !260}
!259 = !DILocalVariable(name: "f", arg: 1, scope: !254, file: !255, line: 118, type: !20)
!260 = !DILocalVariable(name: "result", scope: !261, file: !255, line: 122, type: !7, align: 1)
!261 = distinct !DILexicalBlock(scope: !254, file: !255, line: 122, column: 5)
!262 = !{!263, !180}
!263 = !DITemplateTypeParameter(name: "F", type: !20)
!264 = !DILocation(line: 122, column: 9, scope: !261)
!265 = !DILocation(line: 118, column: 43, scope: !254)
!266 = !DILocation(line: 122, column: 18, scope: !254)
!267 = !DILocation(line: 125, column: 5, scope: !261)
!268 = !DILocation(line: 128, column: 2, scope: !254)
!269 = !DILocation(line: 128, column: 1, scope: !254)
!270 = !DILocation(line: 118, column: 1, scope: !254)
!271 = distinct !DISubprogram(name: "new<&str>", linkageName: "core::fmt::ArgumentV1::new", scope: !273, file: !272, line: 326, type: !318, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !327, retainedNodes: !324)
!272 = !DIFile(filename: "/rustc/7737e0b5c4103216d6fd8cf941b7ab9bdbaace7c/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "7d486092cd3957d561caa81fafa9cc68")
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !41, file: !2, size: 128, align: 64, elements: !274, templateParams: !23, identifier: "bf27cbeede3a5264a55a4b0e65f8b1f8")
!274 = !{!275, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !273, file: !2, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !277, size: 64, align: 64, dwarfAddressSpace: 0)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", file: !2, align: 8, elements: !23, identifier: "f0929237c760eb209a93fa1fd63d46ab")
!278 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !273, file: !2, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !280, size: 64, align: 64, dwarfAddressSpace: 0)
!280 = !DISubroutineType(types: !281)
!281 = !{!31, !276, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !283, size: 64, align: 64, dwarfAddressSpace: 0)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !41, file: !2, size: 512, align: 64, elements: !284, templateParams: !23, identifier: "1afa1cdfc964d1c9d2228387756cf8f")
!284 = !{!285, !287, !289, !290, !306, !307}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !283, file: !2, baseType: !286, size: 32, align: 32, offset: 384)
!286 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !283, file: !2, baseType: !288, size: 32, align: 32, offset: 416)
!288 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !283, file: !2, baseType: !38, size: 8, align: 8, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !283, file: !2, baseType: !291, size: 128, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !292, file: !2, size: 128, align: 64, elements: !293, identifier: "98f8e891b302c09c77c2118a85a82629")
!292 = !DINamespace(name: "option", scope: !33)
!293 = !{!294}
!294 = !DICompositeType(tag: DW_TAG_variant_part, scope: !292, file: !2, size: 128, align: 64, elements: !295, templateParams: !298, identifier: "98f8e891b302c09c77c2118a85a82629_variant_part", discriminator: !304)
!295 = !{!296, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !294, file: !2, baseType: !297, size: 128, align: 64, extraData: i64 0)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !291, file: !2, size: 128, align: 64, elements: !23, templateParams: !298, identifier: "98f8e891b302c09c77c2118a85a82629::None")
!298 = !{!299}
!299 = !DITemplateTypeParameter(name: "T", type: !9)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !294, file: !2, baseType: !301, size: 128, align: 64, extraData: i64 1)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !291, file: !2, size: 128, align: 64, elements: !302, templateParams: !298, identifier: "98f8e891b302c09c77c2118a85a82629::Some")
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !301, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, scope: !292, file: !2, baseType: !305, size: 64, align: 64, flags: DIFlagArtificial)
!305 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !283, file: !2, baseType: !291, size: 128, align: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !283, file: !2, baseType: !308, size: 128, align: 64, offset: 256)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !309, templateParams: !23, identifier: "caf7c9638b00fd617d3c4fbb3206f8b5")
!309 = !{!310, !313}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !308, file: !2, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64, dwarfAddressSpace: 0)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, templateParams: !23, identifier: "ace84f06a9adcdb547edf821249ba8b7")
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !308, file: !2, baseType: !314, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !315, size: 64, align: 64, dwarfAddressSpace: 0)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 3, lowerBound: 0)
!318 = !DISubroutineType(types: !319)
!319 = !{!273, !320, !321}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !98, size: 64, align: 64, dwarfAddressSpace: 0)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&&str, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !322, size: 64, align: 64, dwarfAddressSpace: 0)
!322 = !DISubroutineType(types: !323)
!323 = !{!31, !320, !282}
!324 = !{!325, !326}
!325 = !DILocalVariable(name: "x", arg: 1, scope: !271, file: !272, line: 326, type: !320)
!326 = !DILocalVariable(name: "f", arg: 2, scope: !271, file: !272, line: 326, type: !321)
!327 = !{!328}
!328 = !DITemplateTypeParameter(name: "T", type: !98)
!329 = !DILocation(line: 326, column: 23, scope: !271)
!330 = !DILocation(line: 326, column: 33, scope: !271)
!331 = !DILocation(line: 335, column: 42, scope: !271)
!332 = !DILocation(line: 335, column: 68, scope: !271)
!333 = !DILocation(line: 335, column: 18, scope: !271)
!334 = !DILocation(line: 336, column: 6, scope: !271)
!335 = distinct !DISubprogram(name: "new_v1", linkageName: "core::fmt::Arguments::new_v1", scope: !336, file: !272, line: 383, type: !394, scopeLine: 383, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !396)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !41, file: !2, size: 384, align: 64, elements: !337, templateParams: !23, identifier: "6590b58b44b185fb6f9f3419375e0986")
!337 = !{!338, !344, !388}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !336, file: !2, baseType: !339, size: 128, align: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !340, templateParams: !23, identifier: "a673d89da0bdcf4d8c9ca87ae2c56d84")
!340 = !{!341, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !339, file: !2, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64, dwarfAddressSpace: 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !339, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !336, file: !2, baseType: !345, size: 128, align: 64, offset: 128)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !292, file: !2, size: 128, align: 64, elements: !346, identifier: "15c40ae6fa612036aaf0515d0012e61d")
!346 = !{!347}
!347 = !DICompositeType(tag: DW_TAG_variant_part, scope: !292, file: !2, size: 128, align: 64, elements: !348, templateParams: !351, identifier: "15c40ae6fa612036aaf0515d0012e61d_variant_part", discriminator: !304)
!348 = !{!349, !384}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !347, file: !2, baseType: !350, size: 128, align: 64, extraData: i64 0)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !345, file: !2, size: 128, align: 64, elements: !23, templateParams: !351, identifier: "15c40ae6fa612036aaf0515d0012e61d::None")
!351 = !{!352}
!352 = !DITemplateTypeParameter(name: "T", type: !353)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !354, templateParams: !23, identifier: "287ac05ecc676727a0ec0775483732c9")
!354 = !{!355, !383}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !353, file: !2, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64, dwarfAddressSpace: 0)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !39, file: !2, size: 448, align: 64, elements: !358, templateParams: !23, identifier: "e83c6cea7fcf395a208714db043cdb20")
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !357, file: !2, baseType: !9, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !357, file: !2, baseType: !361, size: 384, align: 64, offset: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !39, file: !2, size: 384, align: 64, elements: !362, templateParams: !23, identifier: "6d7725bd26057748b37c23929ea15964")
!362 = !{!363, !364, !365, !366, !382}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !361, file: !2, baseType: !288, size: 32, align: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !361, file: !2, baseType: !38, size: 8, align: 8, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !361, file: !2, baseType: !286, size: 32, align: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !361, file: !2, baseType: !367, size: 128, align: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !39, file: !2, size: 128, align: 64, elements: !368, identifier: "628c649c6bdddc9720d8c1c79e798e33")
!368 = !{!369}
!369 = !DICompositeType(tag: DW_TAG_variant_part, scope: !39, file: !2, size: 128, align: 64, elements: !370, templateParams: !23, identifier: "628c649c6bdddc9720d8c1c79e798e33_variant_part", discriminator: !381)
!370 = !{!371, !375, !379}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !369, file: !2, baseType: !372, size: 128, align: 64, extraData: i64 0)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !367, file: !2, size: 128, align: 64, elements: !373, templateParams: !23, identifier: "628c649c6bdddc9720d8c1c79e798e33::Is")
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !372, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !369, file: !2, baseType: !376, size: 128, align: 64, extraData: i64 1)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !367, file: !2, size: 128, align: 64, elements: !377, templateParams: !23, identifier: "628c649c6bdddc9720d8c1c79e798e33::Param")
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !376, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !369, file: !2, baseType: !380, size: 128, align: 64, extraData: i64 2)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !367, file: !2, size: 128, align: 64, elements: !23, templateParams: !23, identifier: "628c649c6bdddc9720d8c1c79e798e33::Implied")
!381 = !DIDerivedType(tag: DW_TAG_member, scope: !39, file: !2, baseType: !305, size: 64, align: 64, flags: DIFlagArtificial)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !361, file: !2, baseType: !367, size: 128, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !353, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !347, file: !2, baseType: !385, size: 128, align: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !345, file: !2, size: 128, align: 64, elements: !386, templateParams: !351, identifier: "15c40ae6fa612036aaf0515d0012e61d::Some")
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !385, file: !2, baseType: !353, size: 128, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !336, file: !2, baseType: !389, size: 128, align: 64, offset: 256)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !390, templateParams: !23, identifier: "dc3b5c7208e9a97c5d32fa7b1e1a979b")
!390 = !{!391, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !389, file: !2, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64, dwarfAddressSpace: 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !389, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!336, !339, !389}
!396 = !{!397, !398}
!397 = !DILocalVariable(name: "pieces", arg: 1, scope: !335, file: !272, line: 383, type: !339)
!398 = !DILocalVariable(name: "args", arg: 2, scope: !335, file: !272, line: 383, type: !389)
!399 = !DILocation(line: 383, column: 25, scope: !335)
!400 = !DILocation(line: 383, column: 53, scope: !335)
!401 = !DILocation(line: 384, column: 12, scope: !335)
!402 = !DILocation(line: 384, column: 56, scope: !335)
!403 = !DILocation(line: 384, column: 41, scope: !335)
!404 = !DILocation(line: 387, column: 34, scope: !335)
!405 = !DILocation(line: 387, column: 9, scope: !335)
!406 = !DILocation(line: 388, column: 6, scope: !335)
!407 = !DILocation(line: 385, column: 13, scope: !335)
!408 = distinct !DISubprogram(name: "as_i32", linkageName: "std::sys::unix::process::process_common::ExitCode::as_i32", scope: !191, file: !409, line: 474, type: !410, scopeLine: 474, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !23, retainedNodes: !413)
!409 = !DIFile(filename: "/rustc/7737e0b5c4103216d6fd8cf941b7ab9bdbaace7c/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "5e4688c341384f05a339f0c879a838d3")
!410 = !DISubroutineType(types: !411)
!411 = !{!55, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !191, size: 64, align: 64, dwarfAddressSpace: 0)
!413 = !{!414}
!414 = !DILocalVariable(name: "self", arg: 1, scope: !408, file: !409, line: 474, type: !412)
!415 = !DILocation(line: 474, column: 19, scope: !408)
!416 = !DILocation(line: 475, column: 9, scope: !408)
!417 = !DILocation(line: 476, column: 6, scope: !408)
!418 = distinct !DISubprogram(name: "new_display<&str>", linkageName: "core::fmt::ArgumentV1::new_display", scope: !273, file: !272, line: 316, type: !419, scopeLine: 316, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !327, retainedNodes: !421)
!419 = !DISubroutineType(types: !420)
!420 = !{!273, !320}
!421 = !{!422}
!422 = !DILocalVariable(name: "x", arg: 1, scope: !418, file: !272, line: 316, type: !320)
!423 = !DILocation(line: 316, column: 30, scope: !418)
!424 = !DILocation(line: 317, column: 13, scope: !418)
!425 = !DILocation(line: 318, column: 10, scope: !418)
!426 = distinct !DISubprogram(name: "fmt<str>", linkageName: "<&T as core::fmt::Display>::fmt", scope: !427, file: !272, line: 2128, type: !322, scopeLine: 2128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, templateParams: !431, retainedNodes: !428)
!427 = !DINamespace(name: "{impl#54}", scope: !41)
!428 = !{!429, !430}
!429 = !DILocalVariable(name: "self", arg: 1, scope: !426, file: !272, line: 2128, type: !320)
!430 = !DILocalVariable(name: "f", arg: 2, scope: !426, file: !272, line: 2128, type: !282)
!431 = !{!432}
!432 = !DITemplateTypeParameter(name: "T", type: !34)
!433 = !DILocation(line: 2128, column: 20, scope: !426)
!434 = !DILocation(line: 2128, column: 27, scope: !426)
!435 = !DILocation(line: 2128, column: 71, scope: !426)
!436 = !DILocation(line: 2128, column: 62, scope: !426)
!437 = !DILocation(line: 2128, column: 84, scope: !426)
